apache/nuttx/arch/arm/src/sam34/sam_spi.c
  spi_exchange(dev, NULL, buffer, nwords);
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_spiinitialize
 *
 * Description:
 *   Initialize the selected SPI port
 *
 * Input Parameter:
 *   Port number (for hardware that has mutiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on succcess; a NULL on failure
 *
 ****************************************************************************/

FAR struct spi_dev_s *up_spiinitialize(int port)
{
  FAR struct sam_spidev_s *priv = &g_spidev;
  irqstate_t flags;

  /* The SAM3U has only a single SPI port */

  spivdbg("port=%d\n", port);
  DEBUGASSERT(port == 0);

  /* Set up the initial state */

  priv->cs = 0xff;

  /* Enable clocking to the SPI block */

  sam_spi_enableclk();

  /* Configure multiplexed pins as connected on the board.  Chip select pins
   * must be configured by board-specific logic.
   */

  sam_configgpio(GPIO_SPI0_MISO);
  sam_configgpio(GPIO_SPI0_MOSI);
  sam_configgpio(GPIO_SPI0_SPCK);

  /* Disable SPI clocking */

  putreg32(SPI_CR_SPIDIS, SAM_SPI_CR);

  /* Execute a software reset of the SPI (twice) */

  putreg32(SPI_CR_SWRST, SAM_SPI_CR);
  putreg32(SPI_CR_SWRST, SAM_SPI_CR);
  irqrestore(flags);

  /* Configure the SPI mode register */

  putreg32(SPI_MR_MSTR | SPI_MR_MODFDIS, SAM_SPI_MR);

  /* And enable the SPI */

  putreg32(SPI_CR_SPIEN, SAM_SPI_CR);
  up_mdelay(20);

  /* Flush any pending transfers */

  (void)getreg32(SAM_SPI_SR);
  (void)getreg32(SAM_SPI_RDR);

  /* Initialize the SPI semaphore that enforces mutually exclusive access */

#ifndef CONFIG_SPI_OWNBUS
  sem_init(&priv->exclsem, 0, 1);
#endif
  spi_dumpregs("After initialization");
  return &priv->spidev;
}
#endif /* CONFIG_SAM34_SPI */
